Autodesk.Revit.DB.Structure.ReinforcementUtils.GetNumberOfBarPositions(Autodesk.Revit.DB.Element)
Returns the number of bars that are held.
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.IsBarIncluded(Autodesk.Revit.DB.Element,System.Int32)
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
barPosition:
A bar position index between 0 and NumberOfBarPositions-1.
Returns:
Returns true if the bar at the specified position is included, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPosition is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetListeningDimensions(Autodesk.Revit.DB.Structure.RebarShapeDefinitionBySegments)
segmentsDefinition:
The shape definition by segments.
Returns:
Returns the listening dimensions that are in the shape definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetReferenceLineForMeasuringSegment(System.Int32,System.Boolean,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.XYZ,System.Double,System.Double,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
segmentIdx:
If there is a hook at start, 0 will mean hook at start, 1 the first segment, 2 the second segment...
If there isn't a hook at start, 0 will mean the first segment, 1 the second segment, ...
FakeSegments (180 fillets) are nout counted as segments. e.g. A bar which has two parallel lines and a 180degree arc between them (which is a fake segment in shape definition) it will be considered as having two segments.
atStart:
It is true it will return the reference curve for measure segment at the start of the segment, false for end of the segment.
centerlines:
The hooks of a bar may be rotated outside of a bar plane.
We are expecting that these centerlines to be with hooks into the bar plane.
RebarInstBase::getCenterlineCurvesAtIndex is a function that can give you such curves.
barPlaneNormal:
The bar plane normal.
barDiameter:
The bar diameter.
outOfPlaneBendDiameter:
The out of plane bar diameter.
hookAtStart:
The hook type at start.
hookAtEnd:
The hook type at end.
Returns:
Returns the reference line for measuring the segment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetFullGeometryForCenterlinesForView(System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.View,Autodesk.Revit.DB.Element,System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean,System.Boolean)
Having the centerline curves of a rebar, it will generate full geometry for a specific view.
curves:
The centerlines curves.
view:
The view in which the geometry is generated.
reinforcementElement:
The Reinforcement element from which it will be taken properties for computing the geometry.
It will be used the bar diameter of this element. The RebarStyle will be obtained from the rebar shape at the specified bar index.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
All the information needed for computation will be obtained from the bar with this index in the input rebar set.
projectionGraphicsStyle:
Projection graphic style id.
cutGraphicsStyle:
Cut graphic style id.
testInViewVisibility:
If true, the curves will be checked for visibility in the view.
drawRibbon:
If true, representation will be drawn as ribbon.
Returns:
Returns the generated geometry.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetParameterValueAtIndex(Autodesk.Revit.DB.Element,System.Int32,Autodesk.Revit.DB.ElementId)
Get the parameter value for a bar at the specified index.
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
parameterId:
The parameter Id.
Returns:
The value of the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetHookLengthAtIndex(Autodesk.Revit.DB.Element,System.Int32,System.Int32)
Gets the Hook length at the specified index, at the specified end.
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
end:
The end of the bar. It should be 0 for start, 1 for end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The end should be 0 or 1.
-or-
reinforcementElement is not a Rebar or a RebarInSystem.
-or-
The end does not have a hook attached.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetEndTreatmentAtIndexAtEnd(Autodesk.Revit.DB.Element,System.Int32,System.Int32)
Gets the End Treatment Type id of the bar at the specified index, at the specified end.
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
end:
The end of the bar. It should be 0 for start, 1 for end.
Returns:
Returns the End Treatment Type id of the bar at the specified index, at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The end should be 0 or 1.
-or-
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetHookRotationAngleAtIndexAtEnd(Autodesk.Revit.DB.Element,System.Int32,System.Int32)
Gets the out of plane hook rotation angle of the bar at the specified index, at the specified end.
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
end:
The end of the bar. It should be 0 for start, 1 for end.
Returns:
Returns the out of plane hook rotation angle of the bar at the specified index, at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The end should be 0 or 1.
-or-
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetHookAtIndexAtEnd(Autodesk.Revit.DB.Element,System.Int32,System.Int32)
Gets the Hook Type id of the bar at the specified index, at the specified end.
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
end:
The end of the bar. It should be 0 for start, 1 for end.
Returns:
Returns the Hook type id of the bar at the specified index, at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The end should be 0 or 1.
-or-
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetBarBendingPlaneNormalAtIndex(Autodesk.Revit.DB.Element,System.Int32)
Gets the normal of the plane in which the reinforcement element is bent.
Remarks:
Only the bar segments are used to compute the bar bending plane. Hooks are ignored.
reinforcementElement:
The reinforcement element from which the normal data is provided. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1), representing the bar in set from which we're using the hook data.
Returns:
Returns the normal of the plane in which the reinforcement element is bent. In case of a Free Form bar that is not planar, it will return XYZ(0,0,0).
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetBendDataAtIndex(Autodesk.Revit.DB.Element,System.Int32)
Gets the RebarBendData, at the specified bar index.
reinforcementElement:
The reinforcement element from which the RebarBendData is provided. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1), representing the bar in set from which we're retrieving the RebarBendData.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.RebarShapeMatchesCurvesOfOneBar(Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Element,System.Int32)
Checks if rebarShape matches curves of one particular bar in a reinforcement element.
This check is ignoring hooks and end treatments.
For a bar that is in a Free Form Rebar set that has the workshop instructions set to RebarWorkInstructions.Straight the actual curves are not used. It is used only one line.
rebarShape:
A RebarShape element that defines the shape of the rebar.
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
Returns:
Returns true if rebarShape matches curves, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.AddHooksToCurves(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarBendData,Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition)
Adds hooks to the start and end of the provided chain of curves.
Remarks:
Returns the curves, the hook segments and the hook fillets at both ends. The initial start and end curves are trimmed for the hook fillet to fit.
If the hooks can't be added it will throw InvalidOperationException.
document:
The document.
curveChain:
A chain of curves to which hooks will be added.
rebarBendData:
The RebarBendData class from which the hook will take its properties.
pMultiplanarDefinition:
The multiplanar definition, if applicable.
Returns:
The curves and the hooks at both ends. The initial start and end curves are trimmed for the hook fillet to fit.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.ComputeFilletBetweenCurves(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.Curve,System.Double)
Given two connected input curves this method computes an arc with a given radius tangent to both curves.
The curves will be trimmed for the fillet to fit.
firstCurve:
The first curve.
secondCurve:
The second curve.
filletRadius:
The radius of the fillet arc.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
The provided curves are not connected.

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetRebarShapeIdAtIndex(Autodesk.Revit.DB.Element,System.Int32)
Returns the id of the RebarShape element at the specified bar index.
For shape driven Rebar and RebarInSystem all bars in the set have the same RebarShape, for free-form Rebar the shape can vary.
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.ComputeOutlineInView(Autodesk.Revit.DB.GeometryObject,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Outline@)
This method computes the Outline of the provided GeometryElement in view.
Returns true if the outline was computed successfully and false otherwise.
geometryObject:
The geometry object to compute outline.
dbView:
The view in which the outline is computed
outline:
The computed outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetTransformedCenterlineCurvesAtIndex(Autodesk.Revit.DB.Element,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.ReinforcementFilletingOptions,Autodesk.Revit.DB.Structure.MultiplanarOption,System.Int32)
This method will return the centerline curves for bar at barPositionIndex even if this bar isn't included.
The curves are in the final position. The BarPositionTransform (representing the relative position of any individual bar in the set - a translation along the distribution path)
and MovedBarTransform (representing the movement of the bar relative to its default position along the distribution path) will be applied to the returned curves.
reinforcementElement:
The Reinforcement element for wich Revit will provide the curves.
Should be Rebar or RebarInSystem.
adjustForSelfIntersection:
If the curves overlap, as in a planar stirrup, this parameter controls
whether they should be adjusted to avoid intersection (as in fine views),
or kept in a single plane for simplicity (as in coarse views).
suppressHooks:
Identifies if the chain will include hooks curves.
filletingOption:
Identifies if the chain will include fillets/drawn arcs or neither of them.
multiplanarOption:
If the Rebar is a multi-planar shape, this parameter controls whether to generate only
the curves in the primary plane (IncludeOnlyPlanarCurves), or to generate all curves,
(IncludeAllMultiplanarCurves) including the out-of-plane connector segments as well as
multi-planar copies of the primary plane curves.
This argument is ignored for planar shapes.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
Use the barPositionIndex to obtain all the curves at a specific index in the distribution.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Structure.ReinforcementUtils.GetReinforcementCurvesAsInFamily(Autodesk.Revit.DB.Element,System.Boolean,Autodesk.Revit.DB.Structure.ReinforcementFilletingOptions,Autodesk.Revit.DB.Structure.MultiplanarOption,System.Int32)
A chain of curves representing the centerline of the Reinforcement element.
The curves will lay in XY plane as defined in the RebarShape family.
reinforcementElement:
The Reinforcement element for wich Revit will provide the curves.
Should be Rebar or RebarInSystem.
suppressHooks:
Identifies if the chain will include hooks curves.
filletingOption:
Identifies if the chain will include fillets/drawn arcs or neither of them.
multiplanarOption:
If the Rebar is a multi-planar shape, this parameter controls whether to generate only
the curves in the primary plane (IncludeOnlyPlanarCurves), or to generate all curves,
(IncludeAllMultiplanarCurves) including the out-of-plane connector segments as well as
multi-planar copies of the primary plane curves.
This argument is ignored for planar shapes.
barPositionIndex:
An index between 0 and (number of bars in the rebar set -1).
Use the barPositionIndex to obtain all the curves at a specific index in the distribution.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.Structure.ReinforcementUtils
Static utility class for Rebar and RebarInSystem elements.